src/Catalogs/Замеры/Замеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Замеры</name>
  <owners>Catalog.Задачи</owners>
  <attributes>
    <name>ДатаВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Затрачено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Замеры/ManagerModule.bsl
#Если Сервер Тогда

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ДатаВремяНачала");
	Поля.Добавить("ДатаВремяОкончания");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДеньНедели = Формат(Данные.ДатаВремяНачала, "ДФ=ddd;");
	Дата = Формат(Данные.ДатаВремяНачала, "ДФ=dd.MM.yy;");
	ВремяНачала = Формат(Данные.ДатаВремяНачала, "ДФ=hh:mm;");
	ВремяОкончания = Формат(Данные.ДатаВремяОкончания, "ДФ=hh:mm;");
	
	Представление = СтрШаблон("%1 | %2 | %3 - %4", ДеньНедели, Дата, ВремяНачала, ВремяОкончания)
	
КонецПроцедуры

Функция ПредставлениеЗамера(Замер) Экспорт
	
	Затрачено = ?(ЗначениеЗаполнено(Замер.ДатаВремяОкончания), Замер.ДатаВремяОкончания, ТекущаяДатаСеанса()) - Замер.ДатаВремяНачала;
	Результат = СтрШаблон("[%1] %2", ОбщегоНазначенияКлиентСервер.ПредставлениеТрудозатрат(Затрачено), Замер.Владелец.Наименование);
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
